using System;

namespace SlaveMatrix
{
    [Serializable]
    public struct ブーツ_脚情報
    {
    	public bool ブーツ_タン_タン_表示;

    	public bool ブーツ_タン_縁_縁1_表示;

    	public bool ブーツ_タン_縁_縁2_表示;

    	public bool ブーツ_ブーツ_ブーツ_表示;

    	public bool ブーツ_ブーツ_皺_皺1_表示;

    	public bool ブーツ_ブーツ_皺_皺2_表示;

    	public bool ブーツ_ブーツ_縁_縁1_表示;

    	public bool ブーツ_ブーツ_縁_縁2_表示;

    	public bool ブーツ_ブーツ_縁_縁3_表示;

    	public bool ブーツ_ブーツ_縁_縁4_表示;

    	public bool ブーツ_柄_表示;

    	public bool ブーツ_紐_紐_表示;

    	public bool ブーツ_紐_紐1_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐1_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐1_紐下_紐_表示;

    	public bool ブーツ_紐_紐1_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐1_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐1_紐上_紐_表示;

    	public bool ブーツ_紐_紐2_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐2_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐2_紐下_紐_表示;

    	public bool ブーツ_紐_紐2_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐2_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐2_紐上_紐_表示;

    	public bool ブーツ_紐_紐3_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐3_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐3_紐下_紐_表示;

    	public bool ブーツ_紐_紐3_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐3_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐3_紐上_紐_表示;

    	public bool ブーツ_紐_紐4_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐4_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐4_紐下_紐_表示;

    	public bool ブーツ_紐_紐4_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐4_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐4_紐上_紐_表示;

    	public bool ブーツ_紐_紐5_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐5_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐5_紐下_紐_表示;

    	public bool ブーツ_紐_紐5_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐5_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐5_紐上_紐_表示;

    	public bool ブーツ_紐_紐6_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐6_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐6_紐下_紐_表示;

    	public bool ブーツ_紐_紐6_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐6_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐6_紐上_紐_表示;

    	public bool ブーツ_紐_紐7_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐7_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐7_紐下_紐_表示;

    	public bool ブーツ_紐_紐7_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐7_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐7_紐上_紐_表示;

    	public bool ブーツ_紐_紐8_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐8_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐8_紐下_紐_表示;

    	public bool ブーツ_紐_紐8_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐8_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐8_紐上_紐_表示;

    	public bool ブーツ_紐_紐9_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐9_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐9_紐下_紐_表示;

    	public bool ブーツ_紐_紐9_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐9_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐9_紐上_紐_表示;

    	public bool ブーツ_紐_紐10_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐10_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐10_紐下_紐_表示;

    	public bool ブーツ_紐_紐10_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐10_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐10_紐上_紐_表示;

    	public bool ブーツ_紐_紐11_紐下_金具上_金具_表示;

    	public bool ブーツ_紐_紐11_紐下_金具上_穴_表示;

    	public bool ブーツ_紐_紐11_紐下_紐_表示;

    	public bool ブーツ_紐_紐11_紐上_金具上_金具_表示;

    	public bool ブーツ_紐_紐11_紐上_金具上_穴_表示;

    	public bool ブーツ_紐_紐11_紐上_紐_表示;

    	public bool ブーツ_紐_結び_紐左_紐3_表示;

    	public bool ブーツ_紐_結び_紐左_紐2_表示;

    	public bool ブーツ_紐_結び_紐左_紐1_表示;

    	public bool ブーツ_紐_結び_紐右_紐3_表示;

    	public bool ブーツ_紐_結び_紐右_紐2_表示;

    	public bool ブーツ_紐_結び_紐右_紐1_表示;

    	public bool ブーツ_紐_結び_結び目_表示;

    	public void SetDefault()
    	{
    		ブーツ_タン_タン_表示 = true;
    		ブーツ_タン_縁_縁1_表示 = true;
    		ブーツ_タン_縁_縁2_表示 = true;
    		ブーツ_ブーツ_ブーツ_表示 = true;
    		ブーツ_ブーツ_皺_皺1_表示 = true;
    		ブーツ_ブーツ_皺_皺2_表示 = true;
    		ブーツ_ブーツ_縁_縁1_表示 = true;
    		ブーツ_ブーツ_縁_縁2_表示 = true;
    		ブーツ_ブーツ_縁_縁3_表示 = true;
    		ブーツ_ブーツ_縁_縁4_表示 = true;
    		ブーツ_柄_表示 = true;
    		ブーツ_紐_紐_表示 = true;
    		ブーツ_紐_紐1_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐1_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐1_紐下_紐_表示 = true;
    		ブーツ_紐_紐1_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐1_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐1_紐上_紐_表示 = true;
    		ブーツ_紐_紐2_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐2_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐2_紐下_紐_表示 = true;
    		ブーツ_紐_紐2_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐2_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐2_紐上_紐_表示 = true;
    		ブーツ_紐_紐3_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐3_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐3_紐下_紐_表示 = true;
    		ブーツ_紐_紐3_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐3_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐3_紐上_紐_表示 = true;
    		ブーツ_紐_紐4_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐4_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐4_紐下_紐_表示 = true;
    		ブーツ_紐_紐4_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐4_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐4_紐上_紐_表示 = true;
    		ブーツ_紐_紐5_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐5_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐5_紐下_紐_表示 = true;
    		ブーツ_紐_紐5_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐5_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐5_紐上_紐_表示 = true;
    		ブーツ_紐_紐6_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐6_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐6_紐下_紐_表示 = true;
    		ブーツ_紐_紐6_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐6_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐6_紐上_紐_表示 = true;
    		ブーツ_紐_紐7_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐7_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐7_紐下_紐_表示 = true;
    		ブーツ_紐_紐7_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐7_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐7_紐上_紐_表示 = true;
    		ブーツ_紐_紐8_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐8_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐8_紐下_紐_表示 = true;
    		ブーツ_紐_紐8_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐8_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐8_紐上_紐_表示 = true;
    		ブーツ_紐_紐9_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐9_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐9_紐下_紐_表示 = true;
    		ブーツ_紐_紐9_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐9_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐9_紐上_紐_表示 = true;
    		ブーツ_紐_紐10_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐10_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐10_紐下_紐_表示 = true;
    		ブーツ_紐_紐10_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐10_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐10_紐上_紐_表示 = true;
    		ブーツ_紐_紐11_紐下_金具上_金具_表示 = true;
    		ブーツ_紐_紐11_紐下_金具上_穴_表示 = true;
    		ブーツ_紐_紐11_紐下_紐_表示 = true;
    		ブーツ_紐_紐11_紐上_金具上_金具_表示 = true;
    		ブーツ_紐_紐11_紐上_金具上_穴_表示 = true;
    		ブーツ_紐_紐11_紐上_紐_表示 = true;
    		ブーツ_紐_結び_紐左_紐3_表示 = true;
    		ブーツ_紐_結び_紐左_紐2_表示 = true;
    		ブーツ_紐_結び_紐左_紐1_表示 = true;
    		ブーツ_紐_結び_紐右_紐3_表示 = true;
    		ブーツ_紐_結び_紐右_紐2_表示 = true;
    		ブーツ_紐_結び_紐右_紐1_表示 = true;
    		ブーツ_紐_結び_結び目_表示 = true;
    	}
    }
}
