using System;

namespace SlaveMatrix;

[Serializable]
public struct ブーツ_足情報
{
	public bool ブーツ0_靴底_表示;

	public bool ブーツ0_ヒール_表示;

	public bool ブーツ1_タン_表示;

	public bool ブーツ1_バンプ_バンプ_表示;

	public bool ブーツ1_バンプ_縁_縁1_表示;

	public bool ブーツ1_バンプ_縁_縁2_表示;

	public bool ブーツ1_バンプ_縁_縁3_表示;

	public bool ブーツ1_バンプ_縁_縁4_表示;

	public bool ブーツ1_ハイライト_表示;

	public bool ブーツ1_柄_表示;

	public bool ブーツ1_紐_紐1_紐下_金具上_金具_表示;

	public bool ブーツ1_紐_紐1_紐下_金具上_穴_表示;

	public bool ブーツ1_紐_紐1_紐下_紐_表示;

	public bool ブーツ1_紐_紐1_紐上_金具上_金具_表示;

	public bool ブーツ1_紐_紐1_紐上_金具上_穴_表示;

	public bool ブーツ1_紐_紐1_紐上_紐_表示;

	public bool ブーツ1_紐_紐2_紐下_金具上_金具_表示;

	public bool ブーツ1_紐_紐2_紐下_金具上_穴_表示;

	public bool ブーツ1_紐_紐2_紐下_紐_表示;

	public bool ブーツ1_紐_紐2_紐上_金具上_金具_表示;

	public bool ブーツ1_紐_紐2_紐上_金具上_穴_表示;

	public bool ブーツ1_紐_紐2_紐上_紐_表示;

	public bool ブーツ1_紐_紐3_紐下_金具上_金具_表示;

	public bool ブーツ1_紐_紐3_紐下_金具上_穴_表示;

	public bool ブーツ1_紐_紐3_紐下_紐_表示;

	public bool ブーツ1_紐_紐3_紐上_金具上_金具_表示;

	public bool ブーツ1_紐_紐3_紐上_金具上_穴_表示;

	public bool ブーツ1_紐_紐3_紐上_紐_表示;

	public bool ブーツ1_紐_紐4_紐下_金具上_金具_表示;

	public bool ブーツ1_紐_紐4_紐下_金具上_穴_表示;

	public bool ブーツ1_紐_紐4_紐下_紐_表示;

	public bool ブーツ1_紐_紐4_紐上_金具上_金具_表示;

	public bool ブーツ1_紐_紐4_紐上_金具上_穴_表示;

	public bool ブーツ1_紐_紐4_紐上_紐_表示;

	public bool ブーツ1_紐_紐5_金具1_金具_表示;

	public bool ブーツ1_紐_紐5_金具1_穴_表示;

	public bool ブーツ1_紐_紐5_金具2_金具_表示;

	public bool ブーツ1_紐_紐5_金具2_穴_表示;

	public bool ブーツ1_紐_紐5_紐_表示;

	public void SetDefault()
	{
		ブーツ0_靴底_表示 = true;
		ブーツ0_ヒール_表示 = true;
		ブーツ1_タン_表示 = true;
		ブーツ1_バンプ_バンプ_表示 = true;
		ブーツ1_バンプ_縁_縁1_表示 = true;
		ブーツ1_バンプ_縁_縁2_表示 = true;
		ブーツ1_バンプ_縁_縁3_表示 = true;
		ブーツ1_バンプ_縁_縁4_表示 = true;
		ブーツ1_ハイライト_表示 = true;
		ブーツ1_柄_表示 = true;
		ブーツ1_紐_紐1_紐下_金具上_金具_表示 = true;
		ブーツ1_紐_紐1_紐下_金具上_穴_表示 = true;
		ブーツ1_紐_紐1_紐下_紐_表示 = true;
		ブーツ1_紐_紐1_紐上_金具上_金具_表示 = true;
		ブーツ1_紐_紐1_紐上_金具上_穴_表示 = true;
		ブーツ1_紐_紐1_紐上_紐_表示 = true;
		ブーツ1_紐_紐2_紐下_金具上_金具_表示 = true;
		ブーツ1_紐_紐2_紐下_金具上_穴_表示 = true;
		ブーツ1_紐_紐2_紐下_紐_表示 = true;
		ブーツ1_紐_紐2_紐上_金具上_金具_表示 = true;
		ブーツ1_紐_紐2_紐上_金具上_穴_表示 = true;
		ブーツ1_紐_紐2_紐上_紐_表示 = true;
		ブーツ1_紐_紐3_紐下_金具上_金具_表示 = true;
		ブーツ1_紐_紐3_紐下_金具上_穴_表示 = true;
		ブーツ1_紐_紐3_紐下_紐_表示 = true;
		ブーツ1_紐_紐3_紐上_金具上_金具_表示 = true;
		ブーツ1_紐_紐3_紐上_金具上_穴_表示 = true;
		ブーツ1_紐_紐3_紐上_紐_表示 = true;
		ブーツ1_紐_紐4_紐下_金具上_金具_表示 = true;
		ブーツ1_紐_紐4_紐下_金具上_穴_表示 = true;
		ブーツ1_紐_紐4_紐下_紐_表示 = true;
		ブーツ1_紐_紐4_紐上_金具上_金具_表示 = true;
		ブーツ1_紐_紐4_紐上_金具上_穴_表示 = true;
		ブーツ1_紐_紐4_紐上_紐_表示 = true;
		ブーツ1_紐_紐5_金具1_金具_表示 = true;
		ブーツ1_紐_紐5_金具1_穴_表示 = true;
		ブーツ1_紐_紐5_金具2_金具_表示 = true;
		ブーツ1_紐_紐5_金具2_穴_表示 = true;
		ブーツ1_紐_紐5_紐_表示 = true;
	}
}
